上课方式
---

学习方法和作业规则(重要)
---
- 上课前要预习, 否则要花费额外的大量时间才能掌握上课的内容
- 每节课的作业需要按时提交
- 强制写作业是为了保证你能掌握知识
- 上课的时候会教提问的方法, 提问方法是教学内容的一部分
- 对于不懂的内容/作业/问题(这样的情况是很正常的), 要用提问表的方式提出来, 这样可以高效解决问题
    (这一点非常重要, 上课会着重讲这个提问方法)


注意：
你应该独立保证作业答案的正确性（运行结果符合测试或者题目描述）
不清楚答案对不对的或者做错的情况，应该通过提问解决
你的作业只应该通过个人思考或者提问来完成，不允许私下提问其他人


上课用到的软件(这些会提供， 在相关软件 文件夹中 安找步骤安装）
---
1, Windows 10 以上的操作系统或者 Mac 操作系统或者其他操作系统
2, PyCharm CE（这是一个免费的开发软件，可用于 Windows 或者 Mac 上），请不要自行安装
3, Python 的安装和使用在上课说明，请不要自行安装
4, 请一定一定不要自行安装任何编程环境


其他
---
不要因为有一定编程基础就轻视前两节的编程基础内容
掌握高效解决问题的思路, 养成良好的编码风格, 都是非常重要的, 请重视



第一节课上会讲到的内容如下, 看不懂没有关系, 课上会讲的
变量
循环
四则运算
函数
带参数的函数
多参数的函数
变量命名规则
代码规范













此为第 1 课的上课内容, 请自行完成


预习内容
===
打开示例文件文件夹
运行 code.py （安装完Python环境之后双击该文件）


# 你现在只能用以下两个指令 
# forward()
# right()


你需要写的代码在code.py中

画布中有一个黑色三角箭头
forward(100) 用来把三角箭头往前移动 100 像素
right(90) 用来把三角箭头往右旋转 90 度
三角箭头在一开始的时候朝右

例子 1
画一个边长为 101 像素的正三角形的代码如下
注意
1, 一条语句一行
2, 括号必须是英文字符(使用中文字符会报错误)

forward(101)
right(120)
forward(101)
right(120)
forward(101)
right(120)



根据例子 1 完成下面的题目

你需要在code.py中写代码

不会写的题目先记下来, 或者问我
--------
题目
--------

作业 1
画一个边长为 10 像素的正三角形


作业 2
画一个边长为 99 像素的正方形


作业 3
画一个长宽分别为 168, 99 像素的矩形


作业 4
画一个边长为 33 像素的正三角形


作业 5
画一个边长为 106 像素的正方形


作业 6
画一个长宽分别为 68, 59 像素的矩形


作业 7
画一个边长为 79 的正五边形
提示, 往右旋转 72 度


作业 8
画一个边长为 63 的正六边形
提示, 往右旋转 60 度


作业 9
画一个边长为 159 的正七边形
提示, 往右旋转 52 度


作业 10
画一个边长为 93 的正十边形
提示, 往右旋转 36
